In [5]:
import pandas as pd
CCTV_Seoul = pd.read_csv('./data/01. Seoul_CCTV.csv', encoding='utf-8') #'.' 하위 폴더 / '..'상위 폴더 
CCTV_Seoul.head()

   기관명    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [7]:
CCTV_Seoul.columns

Index(['기관명', '소계', '2013년도 이전', '2014년', '2015년', '2016년'], dtype='object')

In [8]:
CCTV_Seoul.columns[0]

'기관명'

In [9]:
CCTV_Seoul.rename(columns={CCTV_Seoul.columns[0]: '구별'}, inplace=True) # inplace=True 변경 내용 저장
CCTV_Seoul.head()

    구별    소계  2013년도 이전  2014년  2015년  2016년
0  강남구  3238       1292    430    584    932
1  강동구  1010        379     99    155    377
2  강북구   831        369    120    138    204
3  강서구   911        388    258    184     81
4  관악구  2109        846    260    390    613

In [13]:
pop_Seoul = pd.read_excel('./data/01. Seoul_Population.xls')
pop_Seoul.head()

,기간,자치구,세대,인구,인구.1,인구.2,인구.3,인구.4,인구.5,인구.6,인구.7,인구.8,세대당인구,65세이상고령자
0,기간,자치구,세대,합계,합계,합계,한국인,한국인,한국인,등록외국인,등록외국인,등록외국인,세대당인구,65세이상고령자
1,기간,자치구,세대,계,남자,여자,계,남자,여자,계,남자,여자,세대당인구,65세이상고령자
2,2017,합계,4220082,10124579,4957857,5166722,9857426,4830206,5027220,267153,127651,139502,2.34,1365126
3,2017,종로구,73594,164257,80094,84163,154770,75967,78803,9487,4127,5360,2.1,26182
4,2017,중구,60412,134593,66337,68256,125709,62253,63456,8884,4084,4800,2.08,21384

In [14]:
pop_Seoul = pd.read_excel('./data/01. Seoul_Population.xls',
                         header=2, 
                          usecols='B, D, G, J, N')
pop_Seoul.head()

   자치구         계      계.1     계.2  65세이상고령자
0   합계  10124579  9857426  267153   1365126
1  종로구    164257   154770    9487     26182
2   중구    134593   125709    8884     21384
3  용산구    244444   229161   15283     36882
4  성동구    312711   304808    7903     41273

In [15]:
pop_Seoul.rename(columns={pop_Seoul.columns[0]: "구별",
                          pop_Seoul.columns[1]: "인구수",
                          pop_Seoul.columns[2]: "한국인",
                          pop_Seoul.columns[3]: "외국인",
                          pop_Seoul.columns[4]: "고령자",
                         },
                 inplace=True,                 
)
pop_Seoul.head()

    구별       인구수      한국인     외국인      고령자
0   합계  10124579  9857426  267153  1365126
1  종로구    164257   154770    9487    26182
2   중구    134593   125709    8884    21384
3  용산구    244444   229161   15283    36882
4  성동구    312711   304808    7903    41273

In [16]:
pop_Seoul.tail()

     구별     인구수     한국인    외국인    고령자
21  관악구  520929  503297  17632  70046
22  서초구  445401  441102   4299  53205
23  강남구  561052  556164   4888  65060
24  송파구  671173  664496   6677  76582
25  강동구  440359  436223   4136  56161

In [18]:
import numpy as np

In [19]:
s = pd.Series([1, 3, 5, np.nan, 6, 8])
s

0    1.0
1    3.0
2    5.0
3    NaN
4    6.0
5    8.0
dtype: float64

In [20]:
dates = pd.date_range('20130101', periods=6)
dates

DatetimeIndex(['2013-01-01', '2013-01-02', '2013-01-03', '2013-01-04',
               '2013-01-05', '2013-01-06'],
              dtype='datetime64[ns]', freq='D')

In [21]:
df = pd.DataFrame(np.random.randn(6, 4), index=dates, columns=['A', 'B', 'C', 'D'])
df

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484
2013-01-05 -0.533106  0.702285 -1.937462  0.262228
2013-01-06  0.277812  0.030013  0.595640 -2.318956

In [22]:
df.head()

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484
2013-01-05 -0.533106  0.702285 -1.937462  0.262228

In [23]:
df.info()

<class 'pandas.core.frame.DataFrame'>
DatetimeIndex: 6 entries, 2013-01-01 to 2013-01-06
Freq: D
Data columns (total 4 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   A       6 non-null      float64
 1   B       6 non-null      float64
 2   C       6 non-null      float64
 3   D       6 non-null      float64
dtypes: float64(4)
memory usage: 240.0 bytes

In [24]:
df.describe()

              A         B         C         D
count  6.000000  6.000000  6.000000  6.000000
mean  -0.144366  0.112829 -0.508693 -0.478679
std    0.584046  0.834539  1.002379  1.070091
min   -1.100527 -1.030222 -1.937462 -2.318956
25%   -0.424844 -0.538972 -1.222306 -0.885014
50%    0.001094  0.366149 -0.241959 -0.205156
75%    0.233921  0.737049  0.181515  0.214964
max    0.487435  0.954897  0.595640  0.613823

In [26]:
#데이터 정렬
df.sort_values(by='B', ascending=False)

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484
2013-01-05 -0.533106  0.702285 -1.937462  0.262228
2013-01-06  0.277812  0.030013  0.595640 -2.318956
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823

In [27]:
df['A']

2013-01-01    0.487435
2013-01-02   -0.100057
2013-01-03    0.102246
2013-01-04   -1.100527
2013-01-05   -0.533106
2013-01-06    0.277812
Freq: D, Name: A, dtype: float64

In [28]:
df[0:3]

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823

In [29]:
df['20130102':'20130104']

                   A         B         C         D
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484

In [30]:
df.loc[:, ['A', 'B']] #이름으로 지정

                   A         B
2013-01-01  0.487435  0.954897
2013-01-02 -0.100057 -0.728633
2013-01-03  0.102246 -1.030222
2013-01-04 -1.100527  0.748637
2013-01-05 -0.533106  0.702285
2013-01-06  0.277812  0.030013

In [31]:
df.iloc[3:5, 0:2]

                   A         B
2013-01-04 -1.100527  0.748637
2013-01-05 -0.533106  0.702285

In [32]:
df

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484
2013-01-05 -0.533106  0.702285 -1.937462  0.262228
2013-01-06  0.277812  0.030013  0.595640 -2.318956

In [34]:
df[df['A'] > 0]

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-06  0.277812  0.030013  0.595640 -2.318956

In [35]:
df[df > 0]

                   A         B         C         D
2013-01-01  0.487435  0.954897       NaN       NaN
2013-01-02       NaN       NaN       NaN  0.073172
2013-01-03  0.102246       NaN  0.262387  0.613823
2013-01-04       NaN  0.748637       NaN       NaN
2013-01-05       NaN  0.702285       NaN  0.262228
2013-01-06  0.277812  0.030013  0.595640       NaN

In [36]:
df['E'] = ['one', 'one', 'two', 'three', 'four', 'three']
df

                   A         B         C         D      E
2013-01-01  0.487435  0.954897 -0.422817 -1.018858    one
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172    one
2013-01-03  0.102246 -1.030222  0.262387  0.613823    two
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484  three
2013-01-05 -0.533106  0.702285 -1.937462  0.262228   four
2013-01-06  0.277812  0.030013  0.595640 -2.318956  three

In [37]:
df['E'].isin(['two', 'four'])

2013-01-01    False
2013-01-02    False
2013-01-03     True
2013-01-04    False
2013-01-05     True
2013-01-06    False
Freq: D, Name: E, dtype: bool

In [38]:
df

                   A         B         C         D      E
2013-01-01  0.487435  0.954897 -0.422817 -1.018858    one
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172    one
2013-01-03  0.102246 -1.030222  0.262387  0.613823    two
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484  three
2013-01-05 -0.533106  0.702285 -1.937462  0.262228   four
2013-01-06  0.277812  0.030013  0.595640 -2.318956  three

In [39]:
del df['E']
df

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02 -0.100057 -0.728633 -1.488803  0.073172
2013-01-03  0.102246 -1.030222  0.262387  0.613823
2013-01-04 -1.100527  0.748637 -0.061102 -0.483484
2013-01-05 -0.533106  0.702285 -1.937462  0.262228
2013-01-06  0.277812  0.030013  0.595640 -2.318956

In [40]:
df.apply(np.cumsum)

                   A         B         C         D
2013-01-01  0.487435  0.954897 -0.422817 -1.018858
2013-01-02  0.387378  0.226264 -1.911620 -0.945686
2013-01-03  0.489624 -0.803958 -1.649233 -0.331862
2013-01-04 -0.610903 -0.055321 -1.710335 -0.815346
2013-01-05 -1.144008  0.646964 -3.647796 -0.553118
2013-01-06 -0.866196  0.676976 -3.052157 -2.872074